_cves/2020/cve-2020-3952.md

---
layout: post
cve_id: CVE-2020-3952
title: VMware vCenter Server LDAP Broken Access Control
pcap: true
pcap_path: /pcaps/2020/CVE-2020-3952.pcap
nuclei_url: https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2020/CVE-2020-3952.yaml
snort2_rule: N/A
snort3_rule: N/A
author: 0x_Akoko
severity: critical
impact: 'Unauthorized users may access sensitive functions, potentially leading to
  privilege escalation or data exposure.

  '
remediation: 'Apply the latest security patches and updates provided by VMware to
  address access control issues.

  '
reference:
- https://nvd.nist.gov/vuln/detail/CVE-2020-3952
- https://www.vmware.com/security/advisories/VMSA-2020-0006.html
- https://github.com/guardicore/vmware_vcenter_cve_2020_3952
classification:
  cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
  cvss-score: 9.8
  cve-id: CVE-2020-3952
  cwe-id: CWE-306
  epss-score: 0.94355
  epss-percentile: 0.99956
  cpe: cpe:2.3:a:vmware:vcenter_server:6.7:-:*:*:*:*:*:*
metadata:
  verified: false
  max-request: 1
  vendor: vmware
  product: vcenter_server
tags:
- cve
- cve2020
- vmware
- vcenter
- ldap
- auth-bypass
- passive
- kev
- vkev
---

## 🔍 Vulnerability Description
Under certain conditions, vmdir that ships with VMware vCenter Server, as part of an embedded or external Platform Services Controller (PSC), does not correctly implement access controls.


## 🌐 HTTP Request
```nohighlight
POST /sdk/ HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:105.0) Gecko/20100101 Firefox/105.0
Connection: close
Content-Length: 538
Content-Type: text/xml
SOAPAction: "urn:vim25/6.5"
Accept-Encoding: gzip
<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soap:Header>
<operationID>00000001-00000001</operationID>
</soap:Header>
<soap:Body>
<RetrieveServiceContent xmlns="urn:internalvim25">
<_this xsi:type="ManagedObjectReference" type="ServiceInstance">ServiceInstance</_this>
</RetrieveServiceContent>
</soap:Body>
</soap:Envelope>
```

